
/**
 * Заполнить массив заданной длины произвольными положительными числами.
 * Провести анализ списка и найти все числа, которые делятся на два, делятся на три и делятся и на два, и на три.
 * При срабатывании условия выводить соответствующую запись в консоль.
 * В каких случаях будет использован паттерн-матчинг и почему?
 * Реализовать с помощью чистых функций, либо обосновать почему нельзя их использовать в своем решении
 * */

case object CollectionExampleThree{
  def main(args: Array[String]): Unit = {

  }
}
